// Generated by jextract

package com.sunya.netchdf.hdf5Clib.ffm;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class H5F_info2_t {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("version"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("super_size"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("super_ext_size")
        ).withName("super"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("version"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("meta_size"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("tot_space")
        ).withName("free"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("version"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("hdr_size"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG_LONG$LAYOUT.withName("index_size"),
                Constants$root.C_LONG_LONG$LAYOUT.withName("heap_size")
            ).withName("msgs_info")
        ).withName("sohm")
    ).withName("H5F_info2_t");
    public static MemoryLayout $LAYOUT() {
        return H5F_info2_t.$struct$LAYOUT;
    }
    public static class super_ {

        static final  GroupLayout super_$struct$LAYOUT = MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("version"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("super_size"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("super_ext_size")
        );
        public static MemoryLayout $LAYOUT() {
            return super_.super_$struct$LAYOUT;
        }
        static final VarHandle version$VH = super_$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("version"));
        public static VarHandle version$VH() {
            return super_.version$VH;
        }
        public static int version$get(MemorySegment seg) {
            return (int)super_.version$VH.get(seg);
        }
        public static void version$set( MemorySegment seg, int x) {
            super_.version$VH.set(seg, x);
        }
        public static int version$get(MemorySegment seg, long index) {
            return (int)super_.version$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void version$set(MemorySegment seg, long index, int x) {
            super_.version$VH.set(seg.asSlice(index*sizeof()), x);
        }
        static final VarHandle super_size$VH = super_$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("super_size"));
        public static VarHandle super_size$VH() {
            return super_.super_size$VH;
        }
        public static long super_size$get(MemorySegment seg) {
            return (long)super_.super_size$VH.get(seg);
        }
        public static void super_size$set( MemorySegment seg, long x) {
            super_.super_size$VH.set(seg, x);
        }
        public static long super_size$get(MemorySegment seg, long index) {
            return (long)super_.super_size$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void super_size$set(MemorySegment seg, long index, long x) {
            super_.super_size$VH.set(seg.asSlice(index*sizeof()), x);
        }
        static final VarHandle super_ext_size$VH = super_$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("super_ext_size"));
        public static VarHandle super_ext_size$VH() {
            return super_.super_ext_size$VH;
        }
        public static long super_ext_size$get(MemorySegment seg) {
            return (long)super_.super_ext_size$VH.get(seg);
        }
        public static void super_ext_size$set( MemorySegment seg, long x) {
            super_.super_ext_size$VH.set(seg, x);
        }
        public static long super_ext_size$get(MemorySegment seg, long index) {
            return (long)super_.super_ext_size$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void super_ext_size$set(MemorySegment seg, long index, long x) {
            super_.super_ext_size$VH.set(seg.asSlice(index*sizeof()), x);
        }
        public static long sizeof() { return $LAYOUT().byteSize(); }
        public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
        public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
        }
        public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
    }

    public static MemorySegment super_$slice(MemorySegment seg) {
        return seg.asSlice(0, 24);
    }
    public static class free {

        static final  GroupLayout free$struct$LAYOUT = MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("version"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("meta_size"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("tot_space")
        );
        public static MemoryLayout $LAYOUT() {
            return free.free$struct$LAYOUT;
        }
        static final VarHandle version$VH = free$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("version"));
        public static VarHandle version$VH() {
            return free.version$VH;
        }
        public static int version$get(MemorySegment seg) {
            return (int)free.version$VH.get(seg);
        }
        public static void version$set( MemorySegment seg, int x) {
            free.version$VH.set(seg, x);
        }
        public static int version$get(MemorySegment seg, long index) {
            return (int)free.version$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void version$set(MemorySegment seg, long index, int x) {
            free.version$VH.set(seg.asSlice(index*sizeof()), x);
        }
        static final VarHandle meta_size$VH = free$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("meta_size"));
        public static VarHandle meta_size$VH() {
            return free.meta_size$VH;
        }
        public static long meta_size$get(MemorySegment seg) {
            return (long)free.meta_size$VH.get(seg);
        }
        public static void meta_size$set( MemorySegment seg, long x) {
            free.meta_size$VH.set(seg, x);
        }
        public static long meta_size$get(MemorySegment seg, long index) {
            return (long)free.meta_size$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void meta_size$set(MemorySegment seg, long index, long x) {
            free.meta_size$VH.set(seg.asSlice(index*sizeof()), x);
        }
        static final VarHandle tot_space$VH = free$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("tot_space"));
        public static VarHandle tot_space$VH() {
            return free.tot_space$VH;
        }
        public static long tot_space$get(MemorySegment seg) {
            return (long)free.tot_space$VH.get(seg);
        }
        public static void tot_space$set( MemorySegment seg, long x) {
            free.tot_space$VH.set(seg, x);
        }
        public static long tot_space$get(MemorySegment seg, long index) {
            return (long)free.tot_space$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void tot_space$set(MemorySegment seg, long index, long x) {
            free.tot_space$VH.set(seg.asSlice(index*sizeof()), x);
        }
        public static long sizeof() { return $LAYOUT().byteSize(); }
        public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
        public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
        }
        public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
    }

    public static MemorySegment free$slice(MemorySegment seg) {
        return seg.asSlice(24, 24);
    }
    public static class sohm {

        static final  GroupLayout sohm$struct$LAYOUT = MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("version"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("hdr_size"),
            MemoryLayout.structLayout(
                Constants$root.C_LONG_LONG$LAYOUT.withName("index_size"),
                Constants$root.C_LONG_LONG$LAYOUT.withName("heap_size")
            ).withName("msgs_info")
        );
        public static MemoryLayout $LAYOUT() {
            return sohm.sohm$struct$LAYOUT;
        }
        static final VarHandle version$VH = sohm$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("version"));
        public static VarHandle version$VH() {
            return sohm.version$VH;
        }
        public static int version$get(MemorySegment seg) {
            return (int)sohm.version$VH.get(seg);
        }
        public static void version$set( MemorySegment seg, int x) {
            sohm.version$VH.set(seg, x);
        }
        public static int version$get(MemorySegment seg, long index) {
            return (int)sohm.version$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void version$set(MemorySegment seg, long index, int x) {
            sohm.version$VH.set(seg.asSlice(index*sizeof()), x);
        }
        static final VarHandle hdr_size$VH = sohm$struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("hdr_size"));
        public static VarHandle hdr_size$VH() {
            return sohm.hdr_size$VH;
        }
        public static long hdr_size$get(MemorySegment seg) {
            return (long)sohm.hdr_size$VH.get(seg);
        }
        public static void hdr_size$set( MemorySegment seg, long x) {
            sohm.hdr_size$VH.set(seg, x);
        }
        public static long hdr_size$get(MemorySegment seg, long index) {
            return (long)sohm.hdr_size$VH.get(seg.asSlice(index*sizeof()));
        }
        public static void hdr_size$set(MemorySegment seg, long index, long x) {
            sohm.hdr_size$VH.set(seg.asSlice(index*sizeof()), x);
        }
        public static MemorySegment msgs_info$slice(MemorySegment seg) {
            return seg.asSlice(16, 16);
        }
        public static long sizeof() { return $LAYOUT().byteSize(); }
        public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
        public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
        }
        public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
    }

    public static MemorySegment sohm$slice(MemorySegment seg) {
        return seg.asSlice(48, 32);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
}


